# GetEntity Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..GetEntity Method
PipeFittingAndAccessoryData Class See Also
---
Returns an Entity of the Schema of the serverGUID.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Entity GetEntity()
```

Visual Basic
---
```text
Public Function GetEntity As Entity
```

Visual C++
---
```text
public:
Entity^ GetEntity()
```

# ### Return Value
The Entity.
# Remarks
The Entity that is returned is a copy of the stored data (with copy-on-write optimization). Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace